reports/gateway.txt
Running 30s test @ http://localhost:8082/hello.txt
  10 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    23.88ms   20.41ms 315.56ms   90.04%
    Req/Sec     0.90k   264.94     1.56k    68.61%
  267248 requests in 30.06s, 37.72MB read
  Socket errors: connect 0, read 193, write 0, timeout 0
Requests/sec:   8889.84
Transfer/sec:      1.25MB
Running 30s test @ http://localhost:8082/hello.txt
  10 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    23.10ms   16.28ms 297.85ms   84.57%
    Req/Sec     0.92k   215.86     1.67k    73.10%
  275922 requests in 30.08s, 38.95MB read
  Socket errors: connect 0, read 22, write 0, timeout 0
Requests/sec:   9171.69
Transfer/sec:      1.29MB
Running 30s test @ http://localhost:8082/hello.txt
  10 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    20.95ms   21.01ms 350.94ms   95.33%
    Req/Sec     1.08k   249.80     1.65k    72.91%
  320847 requests in 30.10s, 45.29MB read
  Socket errors: connect 0, read 16, write 0, timeout 0
Requests/sec:  10660.04
Transfer/sec:      1.50MB
Running 30s test @ http://localhost:8082/hello.txt
  10 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    21.96ms   12.88ms 142.07ms   71.94%
    Req/Sec     0.94k   174.04     1.59k    69.83%
  281041 requests in 30.05s, 39.67MB read
  Socket errors: connect 0, read 30, write 0, timeout 0
Requests/sec:   9351.23
Transfer/sec:      1.32MB
Running 30s test @ http://localhost:8082/hello.txt
  10 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    21.69ms   12.80ms 114.76ms   70.55%
    Req/Sec     0.95k   179.66     1.65k    68.70%
  284242 requests in 30.07s, 40.12MB read
  Socket errors: connect 0, read 6, write 0, timeout 0
Requests/sec:   9453.70
Transfer/sec:      1.33MB
Running 30s test @ http://localhost:8082/hello.txt
  10 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    22.49ms   12.68ms 110.93ms   68.46%
    Req/Sec     0.91k   171.12     1.51k    66.60%
  271695 requests in 30.06s, 38.35MB read
  Socket errors: connect 0, read 25, write 0, timeout 0
Requests/sec:   9039.10
Transfer/sec:      1.28MB
Running 30s test @ http://localhost:8082/hello.txt
  10 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    23.48ms   14.60ms 124.96ms   71.92%
    Req/Sec     0.89k   199.22     3.19k    72.03%
  265039 requests in 30.09s, 37.41MB read
  Socket errors: connect 0, read 32, write 0, timeout 0
Requests/sec:   8808.43
Transfer/sec:      1.24MB
Running 30s test @ http://localhost:8082/hello.txt
  10 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    21.94ms   13.20ms 114.11ms   68.40%
    Req/Sec     0.94k   179.39     1.71k    67.80%
  280403 requests in 30.06s, 39.58MB read
  Socket errors: connect 0, read 46, write 1, timeout 0
Requests/sec:   9327.81
Transfer/sec:      1.32MB
Running 30s test @ http://localhost:8082/hello.txt
  10 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    22.04ms   13.38ms 123.95ms   70.14%
    Req/Sec     0.94k   190.32     1.50k    69.32%
  280342 requests in 30.07s, 39.57MB read
  Socket errors: connect 0, read 33, write 0, timeout 0
Requests/sec:   9321.56
Transfer/sec:      1.32MB
Running 30s test @ http://localhost:8082/hello.txt
  10 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    22.11ms   13.56ms 111.66ms   70.12%
    Req/Sec     0.94k   183.97     1.59k    65.90%
  279610 requests in 30.05s, 39.47MB read
  Socket errors: connect 0, read 6, write 0, timeout 0
Requests/sec:   9303.46
Transfer/sec:      1.31MB

requests 2806389  300.69  93333.16