reports/linkerd.txt
Running 30s test @ http://localhost:4140/hello.txt
  10 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    25.78ms   14.66ms 181.19ms   81.52%
    Req/Sec   798.47    164.22     1.21k    71.30%
  238905 requests in 30.09s, 43.29MB read
  Socket errors: connect 0, read 14, write 7, timeout 0
Requests/sec:   7939.16
Transfer/sec:      1.44MB
Running 30s test @ http://localhost:4140/hello.txt
  10 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    25.41ms   14.89ms 271.81ms   81.48%
    Req/Sec   809.44    157.74     1.34k    70.93%
  242107 requests in 30.08s, 43.87MB read
Requests/sec:   8049.54
Transfer/sec:      1.46MB
Running 30s test @ http://localhost:4140/hello.txt
  10 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    25.61ms   15.66ms 251.65ms   85.10%
    Req/Sec   808.27    145.87     1.19k    72.01%
  241346 requests in 30.08s, 43.73MB read
Requests/sec:   8022.27
Transfer/sec:      1.45MB
Running 30s test @ http://localhost:4140/hello.txt
  10 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    24.58ms   12.13ms 132.69ms   76.09%
    Req/Sec   825.48    139.02     1.44k    71.90%
  246986 requests in 30.09s, 44.75MB read
  Socket errors: connect 0, read 33, write 0, timeout 0
Requests/sec:   8209.11
Transfer/sec:      1.49MB
Running 30s test @ http://localhost:4140/hello.txt
  10 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    23.51ms   10.83ms 101.52ms   72.62%
    Req/Sec     0.86k   127.39     1.26k    66.20%
  256469 requests in 30.06s, 46.47MB read
  Socket errors: connect 0, read 25, write 0, timeout 0
Requests/sec:   8531.48
Transfer/sec:      1.55MB
Running 30s test @ http://localhost:4140/hello.txt
  10 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    24.18ms   11.57ms 121.14ms   75.24%
    Req/Sec   836.63    136.59     1.31k    67.50%
  250363 requests in 30.10s, 45.37MB read
  Socket errors: connect 0, read 14, write 0, timeout 0
Requests/sec:   8318.69
Transfer/sec:      1.51MB
Running 30s test @ http://localhost:4140/hello.txt
  10 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    24.25ms   10.89ms 109.17ms   78.31%
    Req/Sec   833.69    129.42     1.17k    73.27%
  249331 requests in 30.06s, 45.18MB read
  Socket errors: connect 0, read 30, write 0, timeout 0
Requests/sec:   8295.67
Transfer/sec:      1.50MB
Running 30s test @ http://localhost:4140/hello.txt
  10 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    23.94ms   10.98ms 113.14ms   76.71%
    Req/Sec   844.75    122.13     1.20k    68.23%
  252713 requests in 30.08s, 45.79MB read
  Socket errors: connect 0, read 46, write 2, timeout 0
Requests/sec:   8402.54
Transfer/sec:      1.52MB
Running 30s test @ http://localhost:4140/hello.txt
  10 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    24.09ms   12.23ms 197.87ms   82.88%
    Req/Sec   849.84    124.23     1.61k    72.85%
  253724 requests in 30.09s, 45.97MB read
Requests/sec:   8431.23
Transfer/sec:      1.53MB
Running 30s test @ http://localhost:4140/hello.txt
  10 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    24.62ms   11.43ms 116.36ms   79.47%
    Req/Sec   823.94    145.20     1.19k    72.43%
  246562 requests in 30.08s, 44.68MB read
Requests/sec:   8196.41
Transfer/sec:      1.49MB