reports/zuul.txt
Running 30s test @ http://localhost:8081/hello.txt
  10 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    45.09ms   46.72ms 551.03ms   87.26%
    Req/Sec   538.01    168.90     1.26k    68.92%
  159854 requests in 30.09s, 25.03MB read
  Socket errors: connect 0, read 214, write 0, timeout 0
Requests/sec:   5312.48
Transfer/sec:    851.77KB
Running 30s test @ http://localhost:8081/hello.txt
  10 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    43.14ms   42.16ms 520.93ms   84.50%
    Req/Sec   566.36    156.41     1.21k    67.93%
  169398 requests in 30.07s, 26.52MB read
Requests/sec:   5632.78
Transfer/sec:      0.88MB
Running 30s test @ http://localhost:8081/hello.txt
  10 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    48.88ms   74.37ms   1.07s    93.21%
    Req/Sec   596.20    200.70     1.68k    71.52%
  177333 requests in 30.10s, 27.77MB read
  Socket errors: connect 0, read 60, write 0, timeout 0
Requests/sec:   5891.58
Transfer/sec:      0.92MB
Running 30s test @ http://localhost:8081/hello.txt
  10 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    41.60ms   49.47ms 975.69ms   90.21%
    Req/Sec   638.50    182.38     1.13k    71.02%
  189922 requests in 30.08s, 29.74MB read
  Socket errors: connect 0, read 68, write 0, timeout 0
Requests/sec:   6314.32
Transfer/sec:      0.99MB
Running 30s test @ http://localhost:8081/hello.txt
  10 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    47.11ms   51.31ms 707.98ms   88.58%
    Req/Sec   545.70    140.42     1.15k    70.95%
  162043 requests in 30.09s, 25.37MB read
  Socket errors: connect 0, read 22, write 0, timeout 0
Requests/sec:   5384.46
Transfer/sec:    863.30KB
Running 30s test @ http://localhost:8081/hello.txt
  10 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    44.03ms   45.53ms 590.36ms   87.78%
    Req/Sec   569.80    143.74     1.20k    70.74%
  169984 requests in 30.06s, 26.61MB read
  Socket errors: connect 0, read 70, write 0, timeout 0
Requests/sec:   5654.92
Transfer/sec:      0.89MB
Running 30s test @ http://localhost:8081/hello.txt
  10 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    49.15ms   57.44ms 812.96ms   88.43%
    Req/Sec   556.92    182.71     1.50k    67.79%
  166551 requests in 30.08s, 26.08MB read
  Socket errors: connect 0, read 60, write 0, timeout 0
Requests/sec:   5536.15
Transfer/sec:      0.87MB
Running 30s test @ http://localhost:8081/hello.txt
  10 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    32.10ms   29.28ms 431.74ms   82.53%
    Req/Sec   732.84    167.97     1.21k    71.23%
  219065 requests in 30.05s, 34.30MB read
  Socket errors: connect 0, read 61, write 0, timeout 0
Requests/sec:   7289.54
Transfer/sec:      1.14MB
Running 30s test @ http://localhost:8081/hello.txt
  10 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    31.57ms   28.02ms 347.07ms   79.78%
    Req/Sec   736.91    161.24     1.20k    67.33%
  220261 requests in 30.04s, 34.49MB read
  Socket errors: connect 0, read 70, write 0, timeout 0
Requests/sec:   7333.30
Transfer/sec:      1.15MB
Running 30s test @ http://localhost:8081/hello.txt
  10 threads and 200 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    34.28ms   32.03ms 535.99ms   84.27%
    Req/Sec   693.60    145.25     1.15k    70.94%
  206537 requests in 30.02s, 32.34MB read
  Socket errors: connect 0, read 81, write 0, timeout 0
Requests/sec:   6879.27
Transfer/sec:      1.08MB